; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob32) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear crate2)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 341)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 224)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 78)
	(at crate1 depot0)
	(on crate1 crate0)
	(= (weight crate1) 64)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 87)
	(at crate3 depot0)
	(on crate3 crate1)
	(= (weight crate3) 62)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 65)
	(at crate5 distributor0)
	(on crate5 pallet1)
	(= (weight crate5) 4)
	(at crate6 distributor0)
	(on crate6 crate5)
	(= (weight crate6) 83)
	(at crate7 distributor0)
	(on crate7 crate6)
	(= (weight crate7) 43)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate2 crate4)
		(on crate3 crate2)
		(on crate4 crate7)
		(on crate5 pallet2)
		(on crate6 pallet0)
		(on crate7 crate0)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 0 to 10
   goals met: 0 of 7
2. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   changed: (fuel-cost) from 10 to 11
   goals met: 0 of 7
3. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 7
4. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 7
5. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 7
6. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 43
   goals met: 0 of 7
7. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 7
8. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 7
9. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 34 to 44
   goals met: 0 of 7
10. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 44 to 54
   goals met: 0 of 7
11. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 83
   goals met: 0 of 7
12. (lift hoist1 crate5 pallet1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 pallet1)
   added: (lifting hoist1 crate5) (clear pallet1)
   changed: (fuel-cost) from 54 to 55
   goals met: 0 of 7
13. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 83 to 87
   goals met: 0 of 7
14. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 55 to 65
   goals met: 0 of 7
15. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 65 to 75
   goals met: 0 of 7
16. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 87 to 152
   goals met: 0 of 7
17. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 75 to 85
   goals met: 0 of 7
18. (lift hoist0 crate3 crate1 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate1)
   added: (lifting hoist0 crate3) (clear crate1)
   changed: (fuel-cost) from 85 to 86
   goals met: 0 of 7
19. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 86 to 96
   goals met: 0 of 7
20. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 43 to 130
   goals met: 0 of 7
21. (unload hoist2 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck1) from 152 to 148
   goals met: 0 of 7
22. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 96 to 106
   goals met: 0 of 7
23. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 106 to 116
   goals met: 0 of 7
24. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   changed: (current_load truck1) from 148 to 210
   goals met: 0 of 7
25. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate0)
   added: (lifting hoist0 crate1) (clear crate0)
   changed: (fuel-cost) from 116 to 117
   goals met: 0 of 7
26. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 130 to 194
   goals met: 0 of 7
27. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 117 to 118
   goals met: 0 of 7
28. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 194 to 272
   goals met: 0 of 7
29. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 210 to 127
   goals met: 0 of 7
30. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 118 to 128
   goals met: 0 of 7
31. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 128 to 138
   goals met: 0 of 7
32. (drop hoist2 crate5 pallet2 distributor1)
   deleted: (lifting hoist2 crate5) (clear pallet2)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 pallet2)
   goals met: 1 of 7
33. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 272 to 194
   goals met: 1 of 7
34. (drop hoist2 crate0 crate5 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate5)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate5)
   goals met: 2 of 7
35. (unload hoist2 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 194 to 151
   goals met: 2 of 7
36. (drop hoist2 crate7 crate0 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate0)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate0)
   goals met: 3 of 7
37. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 127 to 62
   goals met: 3 of 7
38. (drop hoist2 crate4 crate7 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate7)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate7)
   goals met: 4 of 7
39. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 151 to 64
   goals met: 4 of 7
40. (drop hoist2 crate2 crate4 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate4)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate4)
   goals met: 5 of 7
41. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 62 to 0
   goals met: 5 of 7
42. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 6 of 7
43. (drop hoist2 crate3 crate2 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate2)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate2)
   goals met: 7 of 7
